app/controllers/games_controller.rb

  def create
    @game = Game.create(deck_id: params[:id])
---
INSERT INTO "games" ("deck_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["deck_id", 3], ["created_at", "2017-10-17 06:19:29.525644"], ["updated_at", "2017-10-17 06:19:29.525644"]]

  def update
    @game = Game.find(session[:game])
    card = Card.find(params[:card])
    @game.check_correct(card, params[:answer])
    @game.save
    next_question = card.id + 1
    if next_question > @game.deck.cards.count
      redirect_to game_path
    else
      redirect_to deck_card_path(@game.deck, Card.find(next_question))
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "games" SET "score" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["score", 1], ["updated_at", "2017-10-17 06:19:37.950924"], ["id", 1]]
SELECT COUNT(*) FROM "cards" WHERE "cards"."deck_id" = $1  [["deck_id", 3]]
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def show
    @game = Game.find(session[:game])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]